# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [6]:
x1 = pd.Series(np.random.randint(1,5, size = 100))
x2 = pd.Series(np.random.randint(1,4, size = 100))
x3 = pd.Series(np.random.randint(10000,30000, size = 100))
x1

0     3
1     3
2     1
3     3
4     1
5     1
6     4
7     2
8     4
9     2
10    1
11    3
12    3
13    3
14    1
15    3
16    1
17    1
18    3
19    1
20    1
21    3
22    3
23    2
24    2
25    4
26    3
27    1
28    1
29    3
     ..
70    4
71    2
72    2
73    4
74    1
75    2
76    2
77    4
78    3
79    2
80    4
81    2
82    4
83    1
84    1
85    4
86    1
87    1
88    1
89    3
90    2
91    4
92    3
93    2
94    3
95    1
96    3
97    3
98    1
99    4
Length: 100, dtype: int64

### Step 3. Let's create a DataFrame by joinning the Series by column

In [5]:
df = pd.concat([x1,x2,x3], axis = 1)
df.head()

   0  1      2
0  2  1  15828
1  3  1  25984
2  3  1  29562
3  4  3  12052
4  4  1  11702

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [11]:
# rename inplace = True
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df.head()

   bedrs  bathrs  price_sqr_meter
0      2       1            15828
1      3       1            25984
2      3       1            29562
3      4       3            12052
4      4       1            11702

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [20]:
df1 = pd.DataFrame({})
df1['bigcolumn'] = pd.concat([df['bedrs'], df['bathrs'], df['price_sqr_meter']])
# to_frame -> Series to DataFrame

pandas.core.frame.DataFrame

### Step 6. Ops it seems it is going only until index 99. Is it true?

In [15]:
df1.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [18]:
df1 = df1.reset_index()